#!/bin/bash
#Напишите команду для добавления route из подсети 1 задания 3. к сетям 2.3.4. Создайте скриптовый файл add_routes.sh который добавлял бы эти маршруты и файл route_delete который удалял их из таблицы адресации.
route add -net 212.100.54.10 netmask 255.255.255.192 gw 212.100.54.64
route add -net 212.100.54.10 netmask 255.255.255.192 gw 212.100.54.128
route add -net 212.100.54.10 netmask 255.255.255.0 gw 212.100.54.192

sudo route add -net 212.100.54.64 netmask 255.255.255.128 gw 212.100.54.1 dev eth0″ >> /etc/network/interfaces
sudo route add -net 212.100.54.0/26 gw 212.100.54.128 dev eth0″ >> /etc/network/interfaces
sudo ip route add 212.100.54.64/26 via 212.100.54.1 dev eth0″ >> /etc/network/interfaces




Подсеть 1
212.100.54.0/26
212.100.54.1 - 212.100.54.62

Подсеть 2
212.100.54.64/26
212.100.54.65 - 212.100.54.126

Подсеть 3
212.100.54.128/26
212.100.54.129 - 212.100.54.190

Подсеть 4
212.100.57.192/26
212.100.57.193 - 212.100.57.254