#!/bin/bash
#Создайте регулярное выражение для проверки правильности написания формата ISBN  (международный код книги) Пример ISBN 5-02-013850-9 (https://uk.wikipedia.org/wiki/ISBN).  Результат в виде команды обработки вывода awk.
#блок 1 - ISBN - Префікс
#блок 2 - ([0-9]){1,3} - Ідентифікатор мовної групи або країни, цифри від 1 до 3 символів
#блок 3 - ([0-9]){1,7} - Ідентифікатор видавництва, цифри від 1 до 7 символів
#блок 4 - ([0-9]){6} - Ідентифікатор книги, цифри від 1 до 6 символів
#блок 5 - [0-9X] - Контрольна цифра, цифра або символ "Х"
echo 'ISBN 5-02-013850-9' | awk '/^ISBN ([0-9]){1,3}-([0-9]){1,7}-([0-9]){6}-[0-9X]/{print $0}'














#echo 'ISBN-10 0-596-52068-9' | awk '/^(?:ISBN(?:-10)?:? )?([0-9X]{10}$|((?:[0-9]+[- ]){3})[- 0-9X]{13}$)[0-9]{1,5}[- ]?[0-9]+[- ]?[0-9]+[- ]?[0-9X]$/{print $0}'